{
  "rs1008": "It seems to be highly expensive and on the other side it's features can't be matched up with Android.It doesn't have fast charging also unlike Android",
  "Seema": "Very bad phone and exoensice",
  "Manish Dhir": "Ultimate performance but some bug issue in 17.2.1 update and FB is not functioning properly….😏😏😏😏😏Lot of BUG issues are experienced in this phone and needs to correct it.",
  "Chankey": "The box had a different colour. I order black Titanium....box was black Titanium but phone was natural titanium inside ...It's heart wrenching...Trust shaken...",
  "Abhijeet": "I like in this phone best camera",
  "Ganesh panu": "Camera quality is best",
  "Najib Khan": "Good product",
  "Mohammed Kamal Khan": "",
  "CHANDAN HAZARIKA": "Hitting problem watching video and charging",
  "Aditi": "This is my 1 st pro iPhone. And so far I’m really impressed with the performance and simplicity of the product.",
  "Janaki": "Camera Quality not good",
  "Rahul kumar": "Lightning fast,titanium tantrums",
  "Shubhasmit": "Fast charging",
  "venky": "Battery 10/10",
  "pallabg": "I have purchased natural titanium and it's really awesome. My first phone purchased with my hardwork.",
  "Manoj": "No heating issue till now running well with the new software update I have installed lots of apps and the ph is running well",
  "Faiz": "Got a defective product where the camera doest load",
  "Abhishek Mukherjee": "box damaged, no new device smell. Completely ruined my unboxing experience. But the phone is amazing.",
  "Amazon Customer": "\n",
  "The Sir Sagz": "Accha hai bass aur kya bolu.",
  "Kallol Mondal": "Iphone always the better than Android , I need the iphone please give me one Amazon please amazon Amazon Amazon",
  "Saekirron": "Heats very much during charger. Even if apple type c charger is used.",
  "Good one": "\n",
  "S. Arivalagan": "No heating issue. Even if they exists for you. Use phone on battery saver mode amazing performance  Very good phone.",
  "Placeholder": "Hangs a lot! Also lagse when using camera. In settings it shows GS5 PRO MAX VARIENT! 😭😭 I bought it for 60000",
  "Rahul S": "When you hold this phone in your hand then only you can realise feeling of holding a premium phone 🍎",
  "Arjun": "Good phone with all thing are there in it.... No need to go for samsung..",
  "RudraKumar": "Best phone ever seen it's the best phone in the earth worth buyable for those who are 4G iphone users.",
  "Playboy": "",
  "Dindayal Bhakat": "Ek number ghatiya phone. dont waste 2lacs on this. Instead pay me some money if you have too much . Dont buy",
  "KSHITIZ": "Nothing new in this phone , just getting things repeated in earlier model,  Apple has nothing to offer new,  seems forgotten their tag line , think different",
  "Santosh Bihari": "Pros :",
  "Shailesh Thakor": "The aluminium has made the phone very light weight you will immediately feel the difference coming from any previous pro max, worth the upgrade if you are coming from 11 series",
  "Nuaa Rawat": "best iphone ever used",
  "RB": "I like all the things in iphone 15 Promax the camera is the world it is totally amazing product Thanks amazon"
}